Задание 1
Импортируйте библиотеку Pandas и дайте ей псевдоним pd.

In [17]:
import pandas as pd
import numpy as np

Создайте датафрейм authors со столбцами author_id и author_name, в которых соответственно содержатся данные: [1, 2, 3] и ['Тургенев', 'Чехов', 'Островский'].
Затем создайте датафрейм book cо столбцами author_id, book_title и price, в которых соответственно содержатся данные:  
[1, 1, 1, 2, 2, 3, 3],
['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
[450, 300, 350, 500, 450, 370, 290].

In [3]:
data = [[1, 'Тургенев'], [2, 'Чехов'], [3, 'Островский']]
  
authors = pd.DataFrame(data, columns=['author_id', 'author_name'])
authors.head()

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [7]:
data = [[1, 'Отцы и дети', 450],
        [1, 'Рудин', 300],
        [1, 'Дворянское гнездо', 350],
        [2, 'Толстый и тонкий', 500],
        [2, 'Дама с собачкой', 450],
        [3, 'Гроза', 370],
        [3, 'Таланты и поклонники', 290]
       ]

books = pd.DataFrame(data, columns=['author_id', 'book_title', 'price'])
books.head()

   author_id         book_title  price
0          1        Отцы и дети    450
1          1              Рудин    300
2          1  Дворянское гнездо    350
3          2   Толстый и тонкий    500
4          2    Дама с собачкой    450

Задание 2
Получите датафрейм authors_price, соединив датафреймы authors и books по полю author_id.

In [9]:
authors_price = authors.merge(books, on = 'author_id', how = 'outer')
authors_price.head()

   author_id author_name         book_title  price
0          1    Тургенев        Отцы и дети    450
1          1    Тургенев              Рудин    300
2          1    Тургенев  Дворянское гнездо    350
3          2       Чехов   Толстый и тонкий    500
4          2       Чехов    Дама с собачкой    450

Задание 3
Создайте датафрейм top5, в котором содержатся строки из authors_price с пятью самыми дорогими книгами.

In [10]:
top5 = authors_price.nlargest(5, 'price')
top5.head()

   author_id author_name         book_title  price
3          2       Чехов   Толстый и тонкий    500
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островский              Гроза    370
2          1    Тургенев  Дворянское гнездо    350

Задание 4
Создайте датафрейм authors_stat на основе информации из authors_price. В датафрейме authors_stat должны быть четыре столбца:
author_name, min_price, max_price и mean_price,
в которых должны содержаться соответственно имя автора, минимальная, максимальная и средняя цена на книги этого автора.

In [13]:
data = []
authors_stat = pd.DataFrame(data)
authors_stat['min_price'] = authors_price.groupby('author_name')['price'].min()
authors_stat['max_price'] = authors_price.groupby('author_name')['price'].max()
authors_stat['mean_price'] = authors_price.groupby('author_name')['price'].mean()
authors_stat.head()

             min_price  max_price  mean_price
author_name
Островский         290        370  330.000000
Тургенев           300        450  366.666667
Чехов              450        500  475.000000

Задание 5**
Создайте новый столбец в датафрейме authors_price под названием cover, в нем будут располагаться данные о том, какая обложка у данной книги - твердая или мягкая. В этот столбец поместите данные из следующего списка:
['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая'].

In [15]:
list = ['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']
authors_price['cover'] = list
authors_price.head(7)

   author_id author_name            book_title  price    cover
0          1    Тургенев           Отцы и дети    450  твердая
1          1    Тургенев                 Рудин    300   мягкая
2          1    Тургенев     Дворянское гнездо    350   мягкая
3          2       Чехов      Толстый и тонкий    500  твердая
4          2       Чехов       Дама с собачкой    450  твердая
5          3  Островский                 Гроза    370   мягкая
6          3  Островский  Таланты и поклонники    290   мягкая

Просмотрите документацию по функции pd.pivot_table с помощью вопросительного знака.Для каждого автора посчитайте суммарную стоимость книг в твердой и мягкой обложке. Используйте для этого функцию pd.pivot_table. При этом столбцы должны называться "твердая" и "мягкая", а индексами должны быть фамилии авторов. Пропущенные значения стоимостей заполните нулями, при необходимости загрузите библиотеку Numpy. Назовите полученный датасет book_info и сохраните его в формат pickle под названием "book_info.pkl".

In [22]:
book_info = pd.pivot_table(authors_price, index=['author_name'], columns=['cover'], aggfunc=np.mean, fill_value=0)
book_info.head()

            author_id          price
cover          мягкая твердая мягкая твердая
author_name
Островский          3       0    330       0
Тургенев            1       1    325     450
Чехов               0       2      0     475

In [24]:
book_info.to_pickle("./book_info.pkl")

Затем загрузите из этого файла датафрейм и назовите его book_info2. Удостоверьтесь, что датафреймы book_info и book_info2 идентичны.

In [25]:
book_info2 = pd.read_pickle("./book_info.pkl")  
book_info2.head()

            author_id          price
cover          мягкая твердая мягкая твердая
author_name
Островский          3       0    330       0
Тургенев            1       1    325     450
Чехов               0       2      0     475

In [26]:
book_info.compare(book_info2)

Empty DataFrame
Columns: []
Index: []

Согласно документации, раз результат compare() – пустой датафрейм, то отличий нет.